#+OPTIONS: ':nil *:t -:t ::t <:t H:3 \n:nil ^:nil arch:headline
#+OPTIONS: author:t broken-links:nil c:nil creator:nil
#+OPTIONS: d:(not "LOGBOOK") date:t e:t email:nil f:t inline:t num:2
#+OPTIONS: p:nil pri:nil prop:nil stat:t tags:t tasks:t tex:t
#+OPTIONS: timestamp:t title:t toc:t todo:t |:t
#+TITLE: Bro Log Analysis with SQLite combining conn and DNS logs
#+DATE: <2017-06-05 13:40:52 Monday>
#+AUTHOR: George Jones
#+EMAIL: eludom@gmail.com
#+LANGUAGE: en
#+SELECT_TAGS: export
#+EXCLUDE_TAGS: noexport
#+CREATOR: Emacs 26.0.50.1 (Org mode 9.0.2)

* What is this?
  - Why :: Learning
  - Who :: George Jones <gmj@pobox.com>
  - When :: <2017-01-15>
  - Where :: Ubuntu 16.04 laptop with base bro install
* Setup
** Create /var/db
   =sudo  mkidr /var/db=
** Enable sqlite    logging of connections in local.bro
    #+begin_example
event bro_init()  
    {  
    local filter: Log::Filter =  
        [  
        $name="sqlite",  
        $path="/var/db/conn",  
        $config=table(["tablename"] = "conn"),  
        $writer=Log::WRITER_SQLITE  
        ];  
      
     Log::add_filter(Conn::LOG, filter);  
    }  


event bro_init()  
    {  
    local filter: Log::Filter =  
        [  
        $name="sqlite",  
        $path="/var/db/dns",  
        $config=table(["tablename"] = "dns"),  
        $writer=Log::WRITER_SQLITE  
        ];  
      
     Log::add_filter(DNS::LOG, filter);  
    }  

    #+end_example
** Deploy and restart
   #+begin_example
   $ sudo broctl
   [BroControl] > deploy
   #+end_example
* Test DB deploy
  Generate some traffic and see if the db file is showing up
  #+BEGIN_EXAMPLE
  $ cd /tmp
  $ wget formtek.com
  $ ls /var/db
conn.sqlite  
  #+END_EXAMPLE
* Now install SQLite so we can query the records
   #+begin_example
   $ sudo apt-get install sqlite3        
   #+end_example
* Summary Queries
** Raw sample of conn log
   #+begin_src shell  :results raw :exports both
             exec 2>&1;set -e; set -u; set +x
     cat << "END" > query.sql
     .header on
     select *
       from conn
       order by ts desc
       limit 10;
     END
     sqlite3 /var/db/conn.sqlite -init query.sql    | \
        sed 2i'-' | \
        sed 's/^/|/' ||  true 
   #+end_src

   #+RESULTS:
   |               ts | uid                |                 id.orig_h | id.orig_p |       id.resp_h | id.resp_p | proto | service |            duration | orig_bytes | resp_bytes | conn_state | local_orig | local_resp | missed_bytes | history  | orig_pkts | orig_ip_bytes | resp_pkts | resp_ip_bytes | tunnel_parents |
   |------------------+--------------------+---------------------------+-----------+-----------------+-----------+-------+---------+---------------------+------------+------------+------------+------------+------------+--------------+----------+-----------+---------------+-----------+---------------+----------------|
   | 1496675559.89047 | CARnQa1YVkeiWibYi9 |            192.168.86.118 |     32931 |    192.168.86.1 |        53 | udp   | dns     | 0.00429391860961914 |         32 |         48 | SF         |          1 |          1 |            0 | Dd       |         1 |            60 |         1 |            76 | (empty)        |
   | 1496675558.50303 | Cl692h1U738Cxm8cAb |            192.168.86.118 |      5355 |     224.0.0.252 |      5355 | udp   | dns     |   0.386311769485474 |         69 |          0 | S0         |          1 |          0 |            0 | D        |         3 |           153 |         0 |             0 | (empty)        |
   | 1496675558.50284 | CQSl1b20kTp6hebyz3 | fe80::60f9:1123:e071:d508 |      5355 |       ff02::1:3 |      5355 | udp   | dns     |   0.384637117385864 |         69 |          0 | S0         |          0 |          0 |            0 | D        |         3 |           213 |         0 |             0 | (empty)        |
   | 1496675544.05812 | CNlfct2MiA49BBaGi  |            192.168.86.118 |     32931 |    192.168.86.1 |        53 | udp   | dns     | 0.00390195846557617 |         42 |        121 | SF         |          1 |          1 |            0 | Dd       |         1 |            70 |         1 |           149 | (empty)        |
   | 1496675539.26323 | CmrzeE4H3so50fSDHj |            192.168.86.118 |     57904 |    8.30.124.216 |       443 | tcp   | ssl     |    20.4993720054626 |       1311 |        730 | SF         |          1 |          0 |            0 | ShADadfF |        10 |          1839 |         8 |          1154 | (empty)        |
   | 1496675518.76339 | CWDM1W2IzjpsSnKyn3 |            192.168.86.118 |     56138 |    8.30.124.216 |       443 | tcp   | ssl     |    20.4981818199158 |       1314 |        730 | SF         |          1 |          0 |            0 | ShADadfF |        10 |          1842 |         8 |          1154 | (empty)        |
   |  1496675512.8945 | CaxMWYaA0I1lQG9Ia  |            192.168.86.118 |     55563 | 239.255.255.250 |      1900 | udp   |         |    3.00381779670715 |        684 |          0 | S0         |          1 |          0 |            0 | D        |         4 |           796 |         0 |             0 | (empty)        |
   | 1496675498.26182 | Coc3yo1FJxC1RhxlD3 |            192.168.86.118 |     55232 |    8.30.124.216 |       443 | tcp   | ssl     |    20.4998052120209 |       1311 |        730 | SF         |          1 |          0 |            0 | ShADadfF |        10 |          1839 |         8 |          1154 | (empty)        |
   | 1496675477.76303 | C4Swz21mn8FPONtDUd |            192.168.86.118 |     53182 |    8.30.124.216 |       443 | tcp   | ssl     |    20.4985589981079 |       1312 |        730 | SF         |          1 |          0 |            0 | ShADadfF |        10 |          1840 |         8 |          1154 | (empty)        |
   | 1496675457.26296 | CnLBcE3OtUEKhWIn5  |            192.168.86.118 |     52216 |    8.30.124.216 |       443 | tcp   | ssl     |    20.4977450370789 |       1311 |        730 | SF         |          1 |          0 |            0 | ShADadfF |        10 |          1839 |         8 |          1154 | (empty)        |

** Raw sample of dns log
   #+begin_src shell  :results raw :exports both
             exec 2>&1;set -e; set -u; set +x
     cat << "END" > query.sql
     .header on
     select *
       from dns
       order by ts desc  
       limit 10;
     END
     sqlite3 /var/db/dns.sqlite -init query.sql    | \
        sed 2i'-' | \
        sed 's/^/|/' ||  true 
   #+end_src

   #+RESULTS:
   |               ts | uid                |                 id.orig_h | id.orig_p |   id.resp_h | id.resp_p | proto | trans_id |              rtt | query                       | qclass | qclass_name | qtype | qtype_name | rcode | rcode_name | AA | TC | RD | RA | Z | answers     |       TTLs | rejected |
   |------------------+--------------------+---------------------------+-----------+-------------+-----------+-------+----------+------------------+-----------------------------+--------+-------------+-------+------------+-------+------------+----+----+----+----+---+-------------+------------+----------|
   | 1496674688.98712 | C5Q6Hg1wq84JKu1R3i |              192.168.86.1 |      5353 | 224.0.0.251 |      5353 | udp   |    28926 |                  | 118.86.168.192.in-addr.arpa |      1 | C_INTERNET  |    12 | PTR        |       |            |  0 |  0 |  1 |  0 | 0 |             |            |        0 |
   | 1496674678.89514 | CvSUcF48V5JU7xLemh | fe80::60f9:1123:e071:d508 |      5353 |    ff02::fb |      5353 | udp   |        0 |                  | _googlecast._tcp.local      |      1 | C_INTERNET  |    12 | PTR        |       |            |  0 |  0 |  0 |  0 | 0 |             |            |        0 |
   | 1496674678.89514 | CvSUcF48V5JU7xLemh | fe80::60f9:1123:e071:d508 |      5353 |    ff02::fb |      5353 | udp   |        0 |                  | _googlecast._tcp.local      |      1 | C_INTERNET  |    12 | PTR        |       |            |  0 |  0 |  0 |  0 | 0 |             |            |        0 |
   | 1496674678.89514 | Ccx9s71guCFdlVrDW7 |            192.168.86.118 |      5353 | 224.0.0.251 |      5353 | udp   |        0 |                  | _googlecast._tcp.local      |      1 | C_INTERNET  |    12 | PTR        |       |            |  0 |  0 |  0 |  0 | 0 |             |            |        0 |
   | 1496674678.89514 | Ccx9s71guCFdlVrDW7 |            192.168.86.118 |      5353 | 224.0.0.251 |      5353 | udp   |        0 |                  | _googlecast._tcp.local      |      1 | C_INTERNET  |    12 | PTR        |       |            |  0 |  0 |  0 |  0 | 0 |             |            |        0 |
   | 1496674676.89513 | CvSUcF48V5JU7xLemh | fe80::60f9:1123:e071:d508 |      5353 |    ff02::fb |      5353 | udp   |        0 |                  | _googlecast._tcp.local      |      1 | C_INTERNET  |    12 | PTR        |       |            |  0 |  0 |  0 |  0 | 0 |             |            |        0 |
   | 1496674676.89513 | CvSUcF48V5JU7xLemh | fe80::60f9:1123:e071:d508 |      5353 |    ff02::fb |      5353 | udp   |        0 |                  | _googlecast._tcp.local      |      1 | C_INTERNET  |    12 | PTR        |       |            |  0 |  0 |  0 |  0 | 0 |             |            |        0 |
   | 1496674676.89513 | Ccx9s71guCFdlVrDW7 |            192.168.86.118 |      5353 | 224.0.0.251 |      5353 | udp   |        0 |                  | _googlecast._tcp.local      |      1 | C_INTERNET  |    12 | PTR        |       |            |  0 |  0 |  0 |  0 | 0 |             |            |        0 |
   | 1496674676.89513 | Ccx9s71guCFdlVrDW7 |            192.168.86.118 |      5353 | 224.0.0.251 |      5353 | udp   |        0 |                  | _googlecast._tcp.local      |      1 | C_INTERNET  |    12 | PTR        |       |            |  0 |  0 |  0 |  0 | 0 |             |            |        0 |
   |  1496674675.8872 | Ccx9s71guCFdlVrDW7 |            192.168.86.118 |      5353 | 224.0.0.251 |      5353 | udp   |        0 | 13.0999178886414 | _googlecast._tcp.local      |      1 | C_INTERNET  |    12 | PTR        |     0 | NOERROR    |  1 |  0 |  0 |  0 | 0 | linux.local | 120.000000 |        0 |

** Who's talking to 209.17.116.160? 

   #+begin_src shell  :results raw :exports both
             exec 2>&1;set -e; set -u; set +x
     cat << "END" > query.sql
     .header on
     select *
       from conn
       where `id.resp_h` = "209.17.116.160"
       limit 10;
     END
     sqlite3 /var/db/conn.sqlite -init query.sql    | \
        sed 2i'-' | \
        sed 's/^/|/' ||  true 
   #+end_src

   #+RESULTS:
   |               ts | uid               |      id.orig_h | id.orig_p |      id.resp_h | id.resp_p | proto | service |         duration | orig_bytes | resp_bytes | conn_state | local_orig | local_resp | missed_bytes | history  | orig_pkts | orig_ip_bytes | resp_pkts | resp_ip_bytes | tunnel_parents |
   |------------------+-------------------+----------------+-----------+----------------+-----------+-------+---------+------------------+------------+------------+------------+------------+------------+--------------+----------+-----------+---------------+-----------+---------------+----------------|
   | 1485131753.29285 | CimLfu4SDLwORxTvh | 192.168.86.105 |     37322 | 209.17.116.160 |        80 | tcp   | http    | 2.17198586463928 |        136 |      54735 | SF         |          1 |          0 |            0 | ShADadFf |        48 |          2640 |        59 |         57811 | (empty)        |
   
** Who is 192.168.86.105 talking to?

   #+begin_src shell  :results raw :exports both
             exec 2>&1;set -e; set -u; set +x
     cat << "END" > query.sql
     .header on
     select `id.resp_h` as resp_h,`id.resp_p` as resp_p, proto, resp_bytes as resp_bytes
       from conn
         where `id.orig_h` = '192.168.86.105' and not resp_h  like '%192.168.86%'
         group by `id.orig_h`,resp_p,proto
         order by resp_h,resp_bytes desc
       limit 20;
     END
     sqlite3 /var/db/conn.sqlite -init query.sql    | \
        sed 2i'-' | \
        sed 's/^/|/' ||  true 
   #+end_src

   #+RESULTS:
   |          resp_h | resp_p | proto | resp_bytes |
   |-----------------+--------+-------+------------|
   | 148.251.190.229 |   9010 | tcp   |     664574 |
   | 184.168.221.104 |     80 | tcp   |      25306 |
   |      192.0.73.2 |   5355 | tcp   |            |
   |  192.30.253.113 |     22 | tcp   |       2125 |
   |  192.42.115.102 |   9004 | tcp   |       3743 |
   |  195.148.124.79 |   6667 | tcp   |      91143 |
   |   213.61.66.118 |   9001 | tcp   |       3413 |
   |  216.58.217.164 |    443 | udp   |       1901 |
   |  216.58.217.164 |    443 | tcp   |        319 |
   |  216.58.217.174 |      3 | icmp  |            |
   |  217.12.199.208 |      1 | icmp  |          0 |
   |     224.0.0.251 |   5353 | udp   |          0 |
   |     224.0.0.252 |   5355 | udp   |          0 |
   | 239.255.255.250 |   1900 | udp   |          0 |
   | 255.255.255.255 |   1124 | udp   |            |
   | 255.255.255.255 |   3289 | udp   |            |
   |  74.208.106.120 |   9080 | tcp   |       1227 |
   |         8.8.8.8 |     53 | udp   |         77 |
   |     91.189.94.4 |    123 | udp   |         48 |

** Raw sample of conn log - most recent
   #+begin_src shell  :results raw :exports both
             exec 2>&1;set -e; set -u; set +x
     cat << "END" > query.sql
     .header on
     select *
       from conn
       order by ts desc
       limit 10;
     END
     sqlite3 /var/db/conn.sqlite -init query.sql    | \
        sed 2i'-' | \
        sed 's/^/|/' ||  true 
   #+end_src

   #+RESULTS:
   |               ts | uid                |                 id.orig_h | id.orig_p |    id.resp_h | id.resp_p | proto | service |            duration | orig_bytes | resp_bytes | conn_state | local_orig | local_resp | missed_bytes | history  | orig_pkts | orig_ip_bytes | resp_pkts | resp_ip_bytes | tunnel_parents |
   |------------------+--------------------+---------------------------+-----------+--------------+-----------+-------+---------+---------------------+------------+------------+------------+------------+------------+--------------+----------+-----------+---------------+-----------+---------------+----------------|
   | 1496674671.54153 | CKX75z61Pen77SPxc  | fe80::60f9:1123:e071:d508 |      5355 |    ff02::1:3 |      5355 | udp   | dns     |   0.347381114959717 |         69 |          0 | S0         |          0 |          0 |            0 | D        |         3 |           213 |         0 |             0 | (empty)        |
   | 1496674671.53977 | CZ3nrk1IZNprw1xy77 |            192.168.86.118 |      5355 |  224.0.0.252 |      5355 | udp   | dns     |   0.347563028335571 |         69 |          0 | S0         |          1 |          0 |            0 | D        |         3 |           153 |         0 |             0 | (empty)        |
   | 1496674661.26573 | Cx7gjr4LGprrUtIr3l |            192.168.86.118 |     32931 | 192.168.86.1 |        53 | udp   | dns     |    2.27884888648987 |         76 |        140 | SF         |          1 |          1 |            0 | Dd       |         2 |           132 |         2 |           196 | (empty)        |
   | 1496674657.75864 | C6Smwl3kC77S0q0Qna |            192.168.86.118 |     58648 | 8.30.124.216 |       443 | tcp   | ssl     |    20.5019609928131 |       1312 |        730 | SF         |          1 |          0 |            0 | ShADadfF |        11 |          1904 |         9 |          1768 | (empty)        |
   | 1496674637.25761 | CbNj7p4KG63Ym1hsZf |            192.168.86.118 |     57014 | 8.30.124.216 |       443 | tcp   | ssl     |    20.4993081092834 |       1311 |        730 | SF         |          1 |          0 |            0 | ShADadfF |        10 |          1851 |         9 |          1768 | (empty)        |
   | 1496674636.16385 | C8pvTw4T7AN7q6S9bf |            192.168.86.118 |      5353 |  224.0.0.251 |      5353 | udp   | dns     |                     |            |            | S0         |          1 |          0 |            0 | D        |         1 |           110 |         0 |             0 | (empty)        |
   | 1496674616.75609 | C6k4Bk49HbbXtQP62f |            192.168.86.118 |     55568 | 8.30.124.216 |       443 | tcp   | ssl     |    20.4993770122528 |       1312 |        730 | SF         |          1 |          0 |            0 | ShADadfF |        10 |          1840 |         8 |          1154 | (empty)        |
   | 1496674611.88361 | CcCMDD1xFKpF0Imqhe | fe80::60f9:1123:e071:d508 |      5353 |     ff02::fb |      5353 | udp   | dns     |    14.4411249160767 |        322 |          0 | S0         |          0 |          0 |            0 | D        |         7 |           658 |         0 |             0 | (empty)        |
   | 1496674611.88348 | CKQlXARnMmSzmA3t2  |            192.168.86.118 |      5353 |  224.0.0.251 |      5353 | udp   | dns     |     3.0018150806427 |        240 |          0 | S0         |          1 |          0 |            0 | D        |         6 |           408 |         0 |             0 | (empty)        |
   | 1496674608.88703 | ClO7ux3MVLZqqqnJq7 |            192.168.86.118 |     32931 | 192.168.86.1 |        53 | udp   | dns     | 0.00188398361206055 |         32 |         48 | SF         |          1 |          1 |            0 | Dd       |         1 |            60 |         1 |            76 | (empty)        |


** Raw sample of dns log - most recent
   #+begin_src shell  :results raw :exports both
             exec 2>&1;set -e; set -u; set +x
     cat << "END" > query.sql
     .header on
     select *
       from dns
       order by ts desc
       limit 10;
     END
     sqlite3 /var/db/dns.sqlite -init query.sql    | \
        sed 2i'-' | \
        sed 's/^/|/' ||  true 
   #+end_src

   #+RESULTS:
   |               ts | uid                |                 id.orig_h | id.orig_p |   id.resp_h | id.resp_p | proto | trans_id |              rtt | query                       | qclass | qclass_name | qtype | qtype_name | rcode | rcode_name | AA | TC | RD | RA | Z | answers     |       TTLs | rejected |
   |------------------+--------------------+---------------------------+-----------+-------------+-----------+-------+----------+------------------+-----------------------------+--------+-------------+-------+------------+-------+------------+----+----+----+----+---+-------------+------------+----------|
   | 1496674688.98712 | C5Q6Hg1wq84JKu1R3i |              192.168.86.1 |      5353 | 224.0.0.251 |      5353 | udp   |    28926 |                  | 118.86.168.192.in-addr.arpa |      1 | C_INTERNET  |    12 | PTR        |       |            |  0 |  0 |  1 |  0 | 0 |             |            |        0 |
   | 1496674678.89514 | CvSUcF48V5JU7xLemh | fe80::60f9:1123:e071:d508 |      5353 |    ff02::fb |      5353 | udp   |        0 |                  | _googlecast._tcp.local      |      1 | C_INTERNET  |    12 | PTR        |       |            |  0 |  0 |  0 |  0 | 0 |             |            |        0 |
   | 1496674678.89514 | CvSUcF48V5JU7xLemh | fe80::60f9:1123:e071:d508 |      5353 |    ff02::fb |      5353 | udp   |        0 |                  | _googlecast._tcp.local      |      1 | C_INTERNET  |    12 | PTR        |       |            |  0 |  0 |  0 |  0 | 0 |             |            |        0 |
   | 1496674678.89514 | Ccx9s71guCFdlVrDW7 |            192.168.86.118 |      5353 | 224.0.0.251 |      5353 | udp   |        0 |                  | _googlecast._tcp.local      |      1 | C_INTERNET  |    12 | PTR        |       |            |  0 |  0 |  0 |  0 | 0 |             |            |        0 |
   | 1496674678.89514 | Ccx9s71guCFdlVrDW7 |            192.168.86.118 |      5353 | 224.0.0.251 |      5353 | udp   |        0 |                  | _googlecast._tcp.local      |      1 | C_INTERNET  |    12 | PTR        |       |            |  0 |  0 |  0 |  0 | 0 |             |            |        0 |
   | 1496674676.89513 | CvSUcF48V5JU7xLemh | fe80::60f9:1123:e071:d508 |      5353 |    ff02::fb |      5353 | udp   |        0 |                  | _googlecast._tcp.local      |      1 | C_INTERNET  |    12 | PTR        |       |            |  0 |  0 |  0 |  0 | 0 |             |            |        0 |
   | 1496674676.89513 | CvSUcF48V5JU7xLemh | fe80::60f9:1123:e071:d508 |      5353 |    ff02::fb |      5353 | udp   |        0 |                  | _googlecast._tcp.local      |      1 | C_INTERNET  |    12 | PTR        |       |            |  0 |  0 |  0 |  0 | 0 |             |            |        0 |
   | 1496674676.89513 | Ccx9s71guCFdlVrDW7 |            192.168.86.118 |      5353 | 224.0.0.251 |      5353 | udp   |        0 |                  | _googlecast._tcp.local      |      1 | C_INTERNET  |    12 | PTR        |       |            |  0 |  0 |  0 |  0 | 0 |             |            |        0 |
   | 1496674676.89513 | Ccx9s71guCFdlVrDW7 |            192.168.86.118 |      5353 | 224.0.0.251 |      5353 | udp   |        0 |                  | _googlecast._tcp.local      |      1 | C_INTERNET  |    12 | PTR        |       |            |  0 |  0 |  0 |  0 | 0 |             |            |        0 |
   |  1496674675.8872 | Ccx9s71guCFdlVrDW7 |            192.168.86.118 |      5353 | 224.0.0.251 |      5353 | udp   |        0 | 13.0999178886414 | _googlecast._tcp.local      |      1 | C_INTERNET  |    12 | PTR        |     0 | NOERROR    |  1 |  0 |  0 |  0 | 0 | linux.local | 120.000000 |        0 |

** Test selecting from 2 tables in SQLite3
   #+begin_src shell  :results raw :exports both
                  exec 2>&1;set -e; set -u; set +x

          cat << "END" > query.sql
     .header on
     attach database '/var/db/conn.sqlite' as conn;
     attach database '/var/db/dns.sqlite' as dns;  

     select source,dest,DNS,proto,resp_p,orig_bytes,resp_bytes from
        (select DISTINCT answers as dest,query as DNS from dns d)
     join
        (select `id.orig_h` as source, `id.resp_h` as c_resp_h,`id.resp_p` as resp_p, proto, orig_bytes, resp_bytes
         from conn c
         where `id.orig_h` = '192.168.86.105' and not c_resp_h  like '%192.168.86%'
         group by `id.orig_h`,resp_p,proto
         order by c_resp_h,resp_bytes desc)
     on (dest = c_resp_h)
     group by DNS,resp_p,proto
     limit 30 ;

     END
          sqlite3 -init query.sql    | \
             sed 2i'-' | \
             sed 's/^/|/' ||  true 
   #+end_src

   #+RESULTS:
   |         source |           dest | DNS                          | proto | resp_p | orig_bytes | resp_bytes |
   |----------------+----------------+------------------------------+-------+--------+------------+------------|
   | 192.168.86.105 | 173.194.66.189 | 0.client-channel.google.com  | icmp  |      3 |        134 |          0 |
   | 192.168.86.105 | 173.194.66.189 | 0.client-channel.google.com  | udp   |    443 |      12750 |     105693 |
   | 192.168.86.105 | 173.194.66.189 | 1.client-channel.google.com  | icmp  |      3 |        134 |          0 |
   | 192.168.86.105 | 173.194.66.189 | 1.client-channel.google.com  | udp   |    443 |      12750 |     105693 |
   | 192.168.86.105 | 173.194.66.189 | 11.client-channel.google.com | icmp  |      3 |        134 |          0 |
   | 192.168.86.105 | 173.194.66.189 | 11.client-channel.google.com | udp   |    443 |      12750 |     105693 |
   | 192.168.86.105 | 173.194.66.189 | 13.client-channel.google.com | icmp  |      3 |        134 |          0 |
   | 192.168.86.105 | 173.194.66.189 | 13.client-channel.google.com | udp   |    443 |      12750 |     105693 |
   | 192.168.86.105 | 173.194.66.189 | 14.client-channel.google.com | icmp  |      3 |        134 |          0 |
   | 192.168.86.105 | 173.194.66.189 | 14.client-channel.google.com | udp   |    443 |      12750 |     105693 |
   | 192.168.86.105 | 173.194.66.189 | 15.client-channel.google.com | icmp  |      3 |        134 |          0 |
   | 192.168.86.105 | 173.194.66.189 | 15.client-channel.google.com | udp   |    443 |      12750 |     105693 |
   | 192.168.86.105 | 173.194.66.189 | 17.client-channel.google.com | icmp  |      3 |        134 |          0 |
   | 192.168.86.105 | 173.194.66.189 | 17.client-channel.google.com | udp   |    443 |      12750 |     105693 |
   | 192.168.86.105 | 173.194.66.189 | 18.client-channel.google.com | icmp  |      3 |        134 |          0 |
   | 192.168.86.105 | 173.194.66.189 | 18.client-channel.google.com | udp   |    443 |      12750 |     105693 |
   | 192.168.86.105 | 173.194.66.189 | 19.client-channel.google.com | icmp  |      3 |        134 |          0 |
   | 192.168.86.105 | 173.194.66.189 | 19.client-channel.google.com | udp   |    443 |      12750 |     105693 |
   | 192.168.86.105 | 173.194.66.189 | 2.client-channel.google.com  | icmp  |      3 |        134 |          0 |
   | 192.168.86.105 | 173.194.66.189 | 2.client-channel.google.com  | udp   |    443 |      12750 |     105693 |
   | 192.168.86.105 | 173.194.66.189 | 20.client-channel.google.com | icmp  |      3 |        134 |          0 |
   | 192.168.86.105 | 173.194.66.189 | 20.client-channel.google.com | udp   |    443 |      12750 |     105693 |
   | 192.168.86.105 | 173.194.66.189 | 21.client-channel.google.com | icmp  |      3 |        134 |          0 |
   | 192.168.86.105 | 173.194.66.189 | 21.client-channel.google.com | udp   |    443 |      12750 |     105693 |
   | 192.168.86.105 | 173.194.66.189 | 22.client-channel.google.com | icmp  |      3 |        134 |          0 |
   | 192.168.86.105 | 173.194.66.189 | 22.client-channel.google.com | udp   |    443 |      12750 |     105693 |
   | 192.168.86.105 | 173.194.66.189 | 3.client-channel.google.com  | icmp  |      3 |        134 |          0 |
   | 192.168.86.105 | 173.194.66.189 | 3.client-channel.google.com  | udp   |    443 |      12750 |     105693 |
   | 192.168.86.105 | 173.194.66.189 | 4.client-channel.google.com  | icmp  |      3 |        134 |          0 |
   | 192.168.86.105 | 173.194.66.189 | 4.client-channel.google.com  | udp   |    443 |      12750 |     105693 |



